GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаГруппойПомещений/гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ЗакреплениеСотрудниковЗаГруппойПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
    </type>
  </attributes>
  <attributes>
    <name>Плавающее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГруппаПомещений</name>
    <type>
      <types>CatalogRef.гхб_ГруппыПомещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаГруппойПомещений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьАктуальныхСотрудниковДляГруппыПомещений(_ГруппаПомещений) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.Сотрудник КАК Сотрудник,
	               |	гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.РежимРаботы КАК РежимРаботы,
	               |	гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.Плавающее КАК Плавающее
	               |ИЗ
	               |	РегистрСведений.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.СрезПоследних(, ГруппаПомещений = &ГруппаПомещений) КАК гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("ГруппаПомещений", _ГруппаПомещений);
	Выборка = Запрос.Выполнить().Выбрать();
	
	_Массив = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		_Массив.Добавить(Новый Структура("Сотрудник, РежимРаботы, Плавающее", Выборка.Сотрудник, Выборка.РежимРаботы, Выборка.Плавающее));
	КонецЦикла;
	
	Возврат _Массив;
	
КонецФункции

Функция ВернутьАктуальныеГруппыПомещенийДляСотрудника(_Сотрудник) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.ГруппаПомещений КАК ГруппаПомещений,
	               |	гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.РежимРаботы КАК РежимРаботы,
	               |	гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.Плавающее КАК Плавающее
	               |ИЗ
	               |	РегистрСведений.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.СрезПоследних(, Сотрудник = &Сотрудник) КАК гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ЗакреплениеСотрудниковЗаГруппойПомещенийСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("Сотрудник", _Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	
	_Массив = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		_Массив.Добавить(Новый Структура("ГруппаПомещений, РежимРаботы, Плавающее", Выборка.ГруппаПомещений, Выборка.РежимРаботы, Выборка.Плавающее));
	КонецЦикла;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
